Repository: vermont42/Conjugar
Catalog: Conjugar/Supporting/Localizable.xcstrings
Source language: en
Languages: es

# Info.participioText
source: ^Use^ The ~participio~ corresponds to the English -en, -ed, or -t form of a verb. This form is used following the auxiliary verb ~haber~ to form various compound tenses, including the %perfecto de indicativo%: "(Yo) $hE$ hablado." = "I have $spOken$." ^Form^ The participio is formed by adding the following endings to the verb stem: ~ar~ verbs: -ado Examples: hablado ("$spOken$"); cantado ("$sUng$"); bailado ("danced") ~er~ verbs: -ido Examples: bebido ("$drUnk$"); leído (requires acute accent; "$reaD$"); comprendido ("$understOOd$") ~ir~ verbs: -ido Examples: vivido ("lived"); sentido ("$fElt$"); hervido ("boiled") When the participio is used as an adjective, it inflects for both gender and number. Example: "una lengua hablada en España" = "a language spoken in Spain" The following verbs have irregular participios: abrir: $abIERTo$ cubrir: $cubIERTo$ decir: $dICHo$ escribir: $escriTo$ hacer: $hECHo$ morir: $mUERTo$ poner: $pUESTo$ pudrir: $pOdrido$ resolver: $resUELTo$ romper: $roTo$ ver: $vISTo$ volver: $vUElTo$ See %credits% for Wikipedia attribution.
es: ^Uso^ El ~participio~ corresponde a la forma inglesa terminanda en -en, -ed, o -t de un verbo. Esta forma se usa tras el verbo auxiliar ~haber~ para formar los tiempos compuestos, como por ejemplo el %perfecto de indicativo%: "(Yo) $ hE $ hablado." = "I have $spOken$." ^Forma^ El participio se forma agregando las siguientes terminaciones a la raíz del verbo: Verbos ~ar~: -ado Ejemplos: hablado ("$spOken$"); cantado ("$sUng$"); bailado ("danced") Verbos ~er~: -ido Ejemplos: bebido ("$drUnk$"); leído (requiere un acento; "$reaD$"); comprendido ("$understOOd$") Verbos ~ir~: -ido Ejemplos: vivido ("lived"); sentido ("$fElt$"); hervido ("boiled") Cuando el participio se usa como un adjetivo, refleja tanto el género como el número del nombre al que acompaña. Ejemplo: "una lengua hablada en España" = "a language spoken in Spain" Los siguientes verbos tienen participios irregulares: abrir: $abIERTo$ cubrir: $cubIERTo$ decir: $dICHo$ escribir: $escriTo$ hacer: $hECHo$ morir: $mUERTo$ poner: $pUESTo$ pudrir: $pOdrido$ resolver: $resUELTo$ romper: $roTo$ ver: $vISTo$ volver: $vUElTo$ Ve a %créditos% para ver la atribución a la Wikipedia.

# Info.perfectoDeIndicativoText
source: ^Uses^ The ~perfecto de indicativo~ has virtually the same use as the tense sometimes called, in English, the "present perfect". "Te $hE dICHo$ mi opinión." = "I have $tOLD$ you my opinion." or "I $tOLD$ you my opinion, and it hasn't changed." In Spanish, as in English, this tense implies that an action, although completed in the past, has continuing effects, truth, or relevance in the present. ^Conjugation^ In the perfecto de indicativo, the %presente de indicativo% conjugation of ~haber~ is used as an auxiliary, and it is followed by the %participio% of the verb to be conjugated. Example: "$hEmos hablado$" = "we have $spOken$" See %credits% for Wikipedia attribution.
es: ^Usos^ El ~perfecto de indicativo~ tiene prácticamente el mismo uso que el tiempo inglés conocido como "present perfect". "Te $ hE dICHo $ mi opinión." = "I have $tOLD$ you my opinion." o "I $tOLD$ you my opinion, and it hasn't changed." Tanto en español como en inglés, este tiempo implica que una acción, aunque se completó en el pasado, tiene efectos, es verdad o tiene relevancia en el presente. ^Conjugación^ En perfecto de indicativo, las formas del %presente de indicativo% de ~haber~ se usa como auxiliar, y le sigue el %participio% del verbo que se conjuga. Ejemplo: "$hEmos hablado$" = "we have $spOken$" Ve a %créditos% para ver la atribución a la Wikipedia.

# Info.perfectoDeSubjuntivoText
source: ^Use^ The ~perfecto de subjuntivo~ expresses doubt, uncertainty, disbelief, or an emotional state with respect to a past action or to an action that will be complete before some other action. "Lamentan que él no $haYa podido$ regresar a la casa." = "They regret that he $WAS$ unable to return home." "Es posible que al finales de este siglo Colombia no $haYa ganado$ la Copa América." = "At the end of the century, it's possible that Colombia will not have $wOn$ the America Cup." "Dudo que $haYas venido$ antes del final de la película." = "I doubt that you will have come before the end of the movie." ^Conjugation^ In the perfecto de subjuntivo, the %presente de subjuntivo% conjugation of ~haber~ is used as an auxiliary, and it is followed by the %participio% of the verb to be conjugated. Example: "$haYa hablado$" = "I $spOke$" or "I have $spOken$" See %credits% for Wikipedia attribution.
es: ^Uso^ El ~perfecto de subjuntivo~ expresa dudas, incertidumbre, incredulidad o un estado emocional con respecto a una acción pasada o a una acción que se completará antes de alguna otra acción. "Lamentan que él no $haYa podido$ regresar a la casa." = "They regret that he $WAS$ unable to return home." "Es posible que al finales de este siglo Colombia no $haYa ganado$ la Copa América." = "At the end of the century, it's possible that Colombia will not have $wOn$ the America Cup." "Dudo que $haYas venido$ antes del final de la película." = "I doubt that you will have come before the end of the movie." ^Conjugación^ En perfecto de subjuntivo, se usa la conjugación del %presente de subjuntivo% de ~haber~ como auxiliar, y le sigue el %participio% del verbo que se conjuga. Ejemplo: "$haYa hablado$" = "I $spOke$" o "I have $spOken$" Ve a %créditos% para leer la atribución a la Wikipedia.

# Info.pluscuamperfectoDeIndicativoText
source: ^Use^ The ~pluscuamperfecto de indicativo~ expresses a past action that occurred prior to another past action. This tense is used in practically the same manner as the English "past perfect" tense. "Cuando bajé a la cocina, mis hijos ya habían preparado el desayuno." = "When I went downstairs to the kitchen, the children had already prepared breakfast." ^Conjugation^ In the pluscuamperfecto de indicativo, the %imperfecto de indicativo% conjugation of ~haber~ is used as an auxiliary, and it is followed by the %participio% of the verb to be conjugated. Example: "$había hablado$" = "it had $spOken$" See %credits% for Wikipedia attribution.
es: ^Uso^ El ~pluscuamperfecto de indicativo~ expresa una acción pasada que ocurrió antes de otra acción pasada. "Cuando bajé a la cocina, mis hijos ya habían preparado el desayuno." = "When I went downstairs to the kitchen, the children had already prepared breakfast." ^Conjugación^ En pluscuamperfecto de indicativo, la conjugación del %imperfecto de indicativo% de ~haber~ se usa como auxiliar, y le sigue el %participio% del verbo que se conjuga. Este tiempo tiene prácticamente el mismo uso que el tiempo inglés conocido como "past perfect". Ejemplo: "$había hablado$ " = "it had $spOken$" Ve a %créditos% para leer la atribución a la Wikipedia.

# Info.pluscuamperfectoDeSubjuntivo1Text
source: ^Use^ The ~pluscuamperfecto de subjuntivo 1~ expresses doubt, uncertainty, or an emotional state with respect to an action occurring before another past action. As shown in the following example, this tense co-occurs with the %condicional compuesto%. This tense is used in the same manner as the English "third conditional" tense. "Si me $hUbiera traÍdo$ una chaqueta, ahora no $tendRía$ frío." = "If I had $brOUGHT$ a jacket, I wouldn't be cold now." Grammarians consider the pluscuamperfecto de subjuntivo 1 and the %pluscuamperfecto de subjuntivo 2% to be different variants of the same tense called simply "pluscuamperfecto de subjuntivo". In modern Spanish, uses of the two variants do not differ. The developer of ~Conjugar~ has treated these variants as separate tenses with different names for pedagogical purposes. ^Conjugation^ In the pluscuamperfecto de subjuntivo 1, the %imperfecto de subjuntivo 1% conjugation of ~haber~ is used as an auxiliary, and it is followed by the %participio% of the verb to be conjugated. Example: "$hUbiera hablado$" = "I had $spOken$"
es: ^Uso^ El ~pluscuamperfecto de subjuntivo 1~ expresa dudas, incertidumbre o un estado emocional con respecto a una acción que ocurrió antes de otra acción pasada. Como se muestra en el siguiente ejemplo, este tiempo a menudo se usa con el %condicional compuesto%. Este tiempo tiene el mismo uso que el tiempo inglés conocido como "third conditional". "Si me $hUbiera traÍdo$ una chaqueta, ahora no $tendRía$ frío." = "If I had $brOUGHT$ a jacket, I wouldn't be cold now." Los expertos en gramática consideran que el pluscuamperfecto de subjuntivo 1 y el %pluscuamperfecto de subjuntivo 2% son variantes diferentes del mismo tiempo, a los que simplemente se les llama "pluscuamperfecto de subjuntivo". En español moderno, los usos de las dos variantes no difieren. El desarrollador de ~Conjugar~ ha tratado estas variantes como tiempos separados con diferentes nombres con fines pedagógicos. ^Conjugación^ En pluscuamperfecto de subjuntivo 1, se usa la conjugación del %imperfecto de subjuntivo 1% de ~haber~ como auxiliar, y le sigue el %participio% del verbo que se conjuga. Ejemplo: "$hUbiera hablado$" = "I had $spOken$"

# Info.pluscuamperfectoDeSubjuntivo2Text
source: ^Use^ The ~pluscuamperfecto de subjuntivo 2~ expresses doubt, uncertainty, or an emotional state with respect to an action occurring before another past action. As shown in the following example, this tense co-occurs with the %condicional compuesto%. "Si me $hUbiese traÍdo$ una chaqueta, ahora no $tendRía$ frío." = "If I had $brOUGHT$ a jacket, I wouldn't be cold now." Grammarians consider the pluscuamperfecto de subjuntivo 2 and the %pluscuamperfecto de subjuntivo 1% to be different variants of the same tense called simply "pluscuamperfecto de subjuntivo". In modern Spanish, uses of the two variants do not differ. The developer of ~Conjugar~ has treated these variants as separate tenses with different names for pedagogical purposes. ^Conjugation^ In the pluscuamperfecto de subjuntivo 2, the %imperfecto de subjuntivo 2% conjugation of ~haber~ is used as an auxiliary, and it is followed by the %participio% of the verb to be conjugated. Example: "$hUbiese hablado$" = "I had $spOken$"
es: ^Uso^ El ~pluscuamperfecto de subjuntivo 2~ expresa dudas, incertidumbre o un estado emocional con respecto a una acción que ocurre antes de otra acción pasada. Como se muestra en el siguiente ejemplo, este tiempo a menudo se usa con el %condicional compuesto%. "Si me $hUbiese traÍdo$ una chaqueta, ahora no $tendRía$ frío." = "If I had $brOUGHT$ a jacket, I wouldn't be cold now." Los gramáticos consideran que el pluscuamperfecto de subjuntivo 2 y el %pluscuamperfecto de subjuntivo 1% son diferentes variantes del mismo tiempo llamado simplemente "pluscuamperfecto de subjuntivo". En español moderno, los usos de las dos variantes no difieren. El desarrollador de ~Conjugar~ ha tratado estas variantes como tiempos separados con diferentes nombres con fines pedagógicos. ^Conjugación^ En pluscuamperfecto de subjuntivo 2, se usa la conjugación del %imperfecto de subjuntivo 2% de ~haber~ como auxiliar, y es seguida por el %participio% del verbo que se conjuga. Ejemplo: "$hUbiese hablado$" = "I had $spOken$"

# Info.presenteDeIndicativoText
source: ^Uses^ The ~presente de indicativo~ is a Spanish verb tense that is used to express the following: • Present action: "Malteamos." = "We are malting." • Habitual action: "Malteamos." = "We have a habit of malting." or "We malt." • Emphasis on present action: "Sí, malteamos." = "Yes, we ~do~ malt." ^Conjugation^ Regular ~ar~, ~ir~, and ~er~ verbs are conjugated in the presente de indicativo by adding the following endings to the verb stem: AR: -o, -as, -a, -amos, -áis, -an IR: -o, -es, -e, -imos, -ís, -en ER: -o, -es, -e, -emos, -éis, -en Examples: habl~ar~: hablo, hablas, habla, hablamos, habláis, hablan sub~ir~: subo, subes, sube, subimos, subís, suben com~er~: como, comes, come, comemos, coméis, comen Two verbs that are irregular in the presente de indicativo deserve especial note. ~Estar~, in the presente de indicativo, is used, in conjunction with the %gerundio%, to emphasize an action's ongoing nature. For example, to translate the sentence "I am reading", one might say "$estoY leYendo$". ~Haber~, in the presente de indicativo, is used, in conjunction with the %participio%, to form the %perfecto de indicativo%, a popular verb tense in Spanish-speaking countries. Tap the blue links for descriptions. Some other verbs that are irregular in the presente de indicativo appear below. Tap the ~Browse~ tab for translations and conjugations. caber, caer, conocer, conducir, construir, crecer, dar, decir, dormir, hacer, huir, ir, jugar, lucir, oír, pedir, pensar, perder, poner, saber, salir, ser, sentir, tener, traer, valer, venir, ver
es: ^Usos^ El ~presente de indicativo~ es un tiempo verbal del español que se utiliza para expresar lo siguiente: • Acción que se realiza en el momento en el que se está hablando: "Malteamos." = "We are malting." • Acción habitual: "Malteamos." = "We have a habit of malting." o "We malt." • Énfasis en la acción que se está realizando ahora mismo: "Sí, malteamos." = "Yes, we ~do~ malt." ^Conjugación^ Los verbos regulares terminados en ~ar~, ~ir~ y ~er~ se conjugan en presente de indicativo agregando las siguientes terminaciones a la raíz del verbo: AR: -o, -as, -a, -amos, -áis, -an IR: -o, -es, -e, -imos, -ís, -en ER: -o, -es, -e, -emos, -éis, -en Ejemplos: habl~ar~: hablo, hablas, habla, hablamos, habláis, hablan sub~ir~: subo, subes, sube, subimos, subís, suben com~er~: como, comes, come, comemos, coméis, comen Hay dos verbos irregulares en presente de indicativo que merecen una nota especial. ~Estar~ se usa en presente de indicativo junto con el %gerundio% para enfatizar la naturaleza continua de una acción. Por ejemplo, para traducir la oración inglesa "I am reading", se podría decir "$estoY leYendo$". ~Haber~ se usa en presente de indicativo junto con el %participio% para formar los tiempos en %perfecto de indicativo%, un tiempo verbal popular en los países de habla hispana. Toca las palabras azules para obtener descripciones. A continuación aparecen algunos otros verbos que son irregulares en presente de indicativo. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones. caber, caer, conocer, conducir, construir, crecer, dar, decir, dormir, hacer, huir, ir, jugar, lucir, oír, pedir, pensar, perder, poner, saber, salir, ser, sentir, tener, traer, valer, venir, ver

# Info.presenteDeSubjuntivoText
source: ^Uses^ The ~presente de subjuntivo~ is used to express: • A command: "Nos manda que $platiQUemos$." = "He is ordering us to talk." • Emotional state: "Tengo miedo de que Colombia no gane la Copa América este año." = "I fear that Colombia will not win the America Cup this year." • Doubt: "Dudo que $venGas$ mañana." = "I doubt that thou $wilT$ come tomorrow." ^Conjugation^ Regular ~ar~, ~ir~, and ~er~ verbs are conjugated in the presente de subjuntivo by adding the following endings to the verb stem: AR: -e, -es, -e, -emos, -éis, -en IR: -a, -as, -a, -amos, -áis, -an ER: -a, -as, -a, -amos, -áis, -an Examples: habl~ar~: hable, hables, hable, hablemos, habléis, hablen sub~ir~: suba, subas, suba, subamos, subáis, suban com~er~: coma, comas, coma, comamos, comáis, coman Some verbs that are irregular in the presente de subjuntivo appear below. Tap the ~Browse~ tab for translations and conjugations. caber, caer, conducir, conocer, construir, crecer, dar, decir, dormir, estar, ir, haber, hacer, huir, jugar, lucir, oír, pedir, pensar, perder, poner, saber, sentir, ser, salir, tener, traer, valer, venir, ver
es: ^Usos^ El ~presente de subjuntivo~ se usa para expresar: • Una orden: "Nos manda que $platiQUemos$." = "He $IS$ ordering us to talk." • Un estado emocional: "Tengo miedo de que Colombia no gane la Copa América este año." = "I fear that Colombia will not win the America Cup this year." • Duda: "Dudo que $venGas$ mañana." = "I doubt that thou $wilT$ come tomorrow." ^Conjugación^ Los verbos regulares en ~ar~, ~ir~ y ~er~ se conjugan en presente de subjuntivo agregando las siguientes terminaciones a la raíz del verbo: AR: -e, -es, -e, -emos, -éis, -en IR: -a, -as, -a, -amos, -áis, -an ER: -a, -as, -a, -amos, -áis, -an Ejemplos: habl~ar~: hable, hables, hable, hablemos, habléis, hablen sub~ir~: suba, subas, suba, subamos, subáis, suban com~er~: coma, comas, coma, comamos, comáis, coman A continuación aparecen algunos verbos que son irregulares en presente de subjuntivo. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones. caber, caer, conducir, conocer, construir, crecer, dar, decir, dormir, estar, ir, haber, hacer, huir, jugar, lucir, escuchar, pedir, pensar, perder, poner, sable, sentir, ser, salir, tener, traer, valer, venir, ver

# Info.preteritoAnteriorText
source: ^Use^ The ~pretérito anterior~ is very rare in spoken Spanish, but it is sometimes used in formal written language, where it is almost entirely limited to subordinate clauses. Thus, it is usually introduced by temporal conjunctions such as cuando, apenas, or en cuanto. This tense is used to express an action that ended immediately before another past action. "Cuando $hUbieron llegado$ todos, empezó la ceremonia." = "When everyone had arrived, the ceremony $begAn$." "Apenas María $hUBO terminado$ la canción, su padre entró." = "As soon as Mary had finished the song, her father $cAme$ in." ^Conjugation^ In the pretérito anterior, the %pretérito% conjugation of ~haber~ is used as an auxiliary, and it is followed by the %participio% of the verb to be conjugated. Example: "$hUBE hablado$" = "I had $spOken$" See %credits% for Wikipedia attribution.
es: ^Uso^ El ~pretérito anterior~ es muy raro en el español hablado, pero a veces se usa en lenguaje escrito formal, donde se limita a oraciones subordinadas en casi todos los casos. Por lo tanto, generalmente aparecen conjunciones temporales antes de esta forma verbal como cuando, apenas o en cuanto. Este tiempo se usa para expresar una acción que terminó inmediatamente antes de otra acción pasada. "Cuando $hUbieron llegado$ todos, comenzó la ceremonia." = "When everyone had arrived, the ceremony $begAn$." "Apenas María $hUBO terminado$ la canción, su padre entró." = "As soon as Mary had finished the song, her father $cAme$ in." ^Conjugación^ En pretérito anterior, la conjugación en %pretérito% de ~haber~ se usa como auxiliar, seguida del %participio% del verbo que se conjuga. Ejemplo: "$hUBE hablado$" = "I had $spOken$" Ve a %créditos% para leer la atribución a la Wikipedia.

# Info.preteritoText
source: ^Uses^ The ~pretérito~ is a Spanish verb tense that is used to express the following: • An action that was done in the past: "Ayer, encontré la flor que tú me $dIste$." = "Yesterday, I found the flower that you $gAve$ me." This use expresses an action that is viewed as a completed event. It is often accompanied by adverbial expressions of time, such as "ayer", "anteayer", or "la semana pasada". • An action that interrupts another action: "Estábamos cenando la cena cuando entró Eduardo." = "We were having dinner when Eduardo $cAme$ in." This expresses an event that happened (and was completed) while another action was taking place. • A general truth: "Las Filipinas $FUeron$ parte del Imperio Español." = "The Philippines were part of the Spanish Empire." This expresses a past relationship that is viewed as finished. ^Conjugation^ Regular ~ar~, ~ir~, and ~er~ verbs are conjugated in the pretérito by adding the following endings to the verb stem: AR: -é, -aste, -ó, -amos, -astéis, -aron IR: -í, -iste, -ió, -imos, -isteis, -ieron ER: -í, -iste, -ió, -imos, -isteis, -ieron Examples: habl~ar~: hablé, hablaste, habló, hablamos, hablastéis, hablaron sub~ir~: subí, subiste, subió, subimos, subisteis, subieron com~er~: comí, comiste, comió, comimos, comisteis, comieron Some verbs that are irregular in the pretérito appear below. Tap the ~Browse~ tab for translations and conjugations. andar, caber, conducir, dar, decir, estar, haber, hacer, ir, poder, poner, querer, saber, ser, tener, traer, venir See %credits% for Wikipedia attribution.
es: ^Usos^ El ~pretérito~ es un tiempo verbal del español que se utiliza para expresar lo siguiente: • Una acción que se realizó en el pasado: "Ayer encontré la flor que tú me $dIste$." = "Yesterday, I found the flower that you $gAve$ me." Este uso expresa una acción que se entiende como un evento terminado. A menudo se acompaña de expresiones de tiempo adverbiales, como "ayer", "anteayer" o "la semana pasada". • Una acción que interrumpe otra acción: "Estábamos cenando cuando entró Eduardo." = "We were having dinner when Eduardo $cAme$ in." Esto expresa un evento que sucedió (y se completó) mientras se realizaba otra acción. • Una verdad general: "Las Filipinas $FUeron$ parte del Imperio Español." = "The Philippines were part of the Spanish Empire." Esto expresa una acción o situación pasada que se ve como terminada. ^Conjugación^ Los verbos regulares terminados en ~ar~, ~ir~ y ~er~ se conjugan en pretérito agregando las siguientes terminaciones a la raíz del verbo: AR: -é, -aste, -ó, -amos, -astéis, -aron IR: -í, -iste, -ió, -imos, -isteis, -ieron ER: -í, -iste, -ió, -imos, -isteis, -ieron Ejemplos: habl~ar~: hablé, hablaste, habló, hablamos, hablastéis, hablaron sub~ir~: subí, subiste, subió, subimos, subisteis, subieron com~er~: comí, comiste, comió, comimos, comisteis, comieron A continuación aparecen algunos verbos que son irregulares en pretérito. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones. andar, caber, conducir, dar, decir, estar, haber, hacer, ir, poder, poner, querer, saber, ser, tener, traer, venir Ve a %créditos% para leer la atribución a la Wikipedia.

# Info.purposeAndUseHeading
source: Purpose & Use
es: Valor y Uso
